[
    {
        "nome": "Feedback 360 Graus",
        "descricao": "Um processo de avaliação no qual o funcionário recebe feedback não apenas de seu supervisor, mas também de seus pares, subordinados diretos e, às vezes, até de clientes. O objetivo é fornecer uma visão holística sobre suas competências e comportamentos.",
        "quando_usar": "Durante ciclos de avaliação de desempenho para fornecer um feedback rico e multifacetado, ou para planos de desenvolvimento individual (PDI).",
        "link": "https://www.qualtrics.com/experience-management/employee/360-feedback/",
        "categorias": ["Desempenho", "Desenvolvimento"],
        "imagem": "https://images.unsplash.com/photo-1556155092-490a1ba16284?ixlib=rb-4.0.3&q=85&fm=jpg&crop=entropy&cs=srgb&w=600",
        "detalhes_markdown": "# Feedback 360 Graus: Uma Visão Completa\n\n**Descrição:** Um processo de avaliação no qual o funcionário recebe feedback anônimo de pessoas que trabalham com ele em diferentes perspectivas: seu gestor (top-down), seus pares (lateral), seus subordinados diretos (bottom-up) e, em alguns casos, até clientes. O funcionário também realiza uma autoavaliação. O objetivo é fornecer uma visão holística sobre suas competências e comportamentos, identificando pontos fortes e áreas de desenvolvimento.\n\n**Quando usar:** Geralmente em ciclos anuais ou semestrais de avaliação de desempenho, ou como um ponto de partida para a criação de um Plano de Desenvolvimento Individual (PDI).\n\n---\n\n## As Perspectivas do Feedback\n\n*   **Gestor:** Avalia o desempenho, o alinhamento com as metas e a contribuição para a equipe.\n*   **Pares:** Avaliam a colaboração, a comunicação e o trabalho em equipe.\n*   **Subordinados:** Avaliam a liderança, a capacidade de delegar, o apoio ao desenvolvimento e a comunicação do gestor.\n*   **Autoavaliação:** O próprio funcionário reflete sobre seu desempenho e competências.\n\n## Benefícios\n\n*   **Visão Abrangente:** Reduz o viés de uma única fonte de feedback (o gestor) e fornece uma imagem mais completa e justa.\n*   **Autoconhecimento:** Ajuda o indivíduo a entender como seu comportamento é percebido por diferentes grupos, identificando pontos cegos.\n*   **Desenvolvimento de Liderança:** É uma ferramenta poderosa para o desenvolvimento de gestores, que recebem feedback direto sobre seu estilo de liderança.\n*   **Cultura de Feedback:** Quando bem implementado, ajuda a promover uma cultura onde o feedback é visto como uma ferramenta de crescimento.\n\n## Desafios e Cuidados\n\n*   **Anonimato vs. Construtividade:** O anonimato é crucial, mas pode levar a comentários vagos ou excessivamente críticos. É importante treinar os participantes a darem feedbacks específicos e construtivos.\n*   **Foco no Desenvolvimento, Não na Punição:** O processo deve ser enquadrado como uma ferramenta de desenvolvimento. Se for usado para decisões de promoção ou demissão, as pessoas podem ficar com medo de dar feedbacks honestos.\n*   **Sobrecarga:** O processo pode ser demorado, tanto para quem responde quanto para quem analisa. É preciso simplificar o questionário e o processo.\n\n### Links Relevantes\n\n*   [Guia da Qualtrics sobre Feedback 360](https://www.qualtrics.com/experience-management/employee/360-feedback/)"
    },
    {
        "nome": "One-on-One (1:1)",
        "descricao": "Reuniões regulares e privadas entre um gestor e um membro da equipe. São uma oportunidade para discutir progresso, desafios, desenvolvimento de carreira e dar/receber feedback contínuo.",
        "quando_usar": "De forma contínua (semanal ou quinzenalmente) para manter o alinhamento, construir confiança e apoiar o crescimento do colaborador.",
        "link": "https://www.atlassian.com/pt/team-playbook/plays/one-on-one-meeting",
        "categorias": ["Engajamento", "Desempenho", "Desenvolvimento"],
        "imagem": "https://images.unsplash.com/photo-1543269865-cbf427effbad?ixlib=rb-4.0.3&q=85&fm=jpg&crop=entropy&cs=srgb&w=600",
        "detalhes_markdown": "# One-on-One (1:1): A Ferramenta Essencial da Gestão\n\n**Descrição:** A reunião One-on-One (1:1) é uma conversa regular, privada e recorrente entre um gestor e um membro direto de sua equipe. **Esta reunião é do liderado, não do gestor.** O objetivo não é uma cobrança de status de tarefas, mas sim um espaço seguro para discutir progresso, desafios, desenvolvimento de carreira, dar e receber feedback e fortalecer a relação de confiança.\n\n**Quando usar:** De forma contínua. A frequência mais comum é semanal ou quinzenal, com duração de 30 a 60 minutos.\n\n---\n\n## Estrutura Sugerida para uma 1:1\n\nUma boa 1:1 pode ser dividida em três partes, com o liderado falando a maior parte do tempo.\n\n1.  **Check-in (10 min):**\n    *   Comece com uma nota pessoal. \"Como você está?\", \"Como foi seu fim de semana?\". O objetivo é conectar-se em um nível humano.\n    *   O liderado compartilha suas prioridades, conquistas e desafios da semana.\n\n2.  **Discussão Profunda (15 min):**\n    *   Este é o coração da reunião. A pauta é definida principalmente pelo liderado. Tópicos podem incluir:\n        *   **Desafios e Bloqueios:** Onde você está travado? Como posso ajudar?\n        *   **Feedback:** O liderado pode dar feedback ao gestor, e o gestor pode oferecer coaching e reconhecimento.\n        *   **Processos da Equipe:** O que está funcionando bem? O que podemos melhorar?\n\n3.  **Futuro e Desenvolvimento (5 min):**\n    *   Foco no crescimento e carreira do liderado.\n    *   \"Quais são seus objetivos de carreira?\", \"O que você gostaria de aprender?\", \"Como posso te ajudar a chegar lá?\".\n\n## Dicas para Gestores\n\n*   **Nunca Cancele:** Cancelar uma 1:1 envia a mensagem de que o liderado não é uma prioridade. Se precisar, remarque, mas não cancele.\n*   **Crie uma Pauta Compartilhada:** Use um documento compartilhado onde ambos possam adicionar tópicos antes da reunião.\n*   **Ouça Ativamente:** Seu papel é ouvir 80% do tempo e falar 20%.\n*   **Anote e Faça Acompanhamento:** Anote os pontos de ação e certifique-se de cumpri-los. Isso constrói confiança.\n\n## Dicas para Liderados\n\n*   **Seja o Dono da Reunião:** Prepare sua pauta. Traga seus desafios, suas vitórias e suas perguntas.\n*   **Seja Honesto:** É o seu espaço seguro para falar sobre o que está te incomodando ou te motivando.\n*   **Peça Feedback:** Não espere que o gestor adivinhe. Peça feedback específico sobre seu trabalho.\n\n### Links Relevantes\n\n*   [Guia da Atlassian sobre 1:1s](https://www.atlassian.com/pt/team-playbook/plays/one-on-one-meeting)"
    },
    {
        "nome": "Plano de Desenvolvimento Individual (PDI)",
        "descricao": "Um plano de ação estruturado para ajudar os funcionários a aprimorar suas habilidades e avançar em suas carreiras. É criado em colaboração entre o funcionário e seu gestor.",
        "quando_usar": "Após avaliações de desempenho, ou a qualquer momento para focar no crescimento profissional, alinhando os objetivos do indivíduo com os da empresa.",
        "link": "https://www.indeed.com/career-advice/career-development/professional-development-plan",
        "categorias": ["Desenvolvimento", "Carreira"],
        "imagem": "https://images.unsplash.com/photo-1454165804606-c3d57bc86b40?ixlib=rb-4.0.3&q=85&fm=jpg&crop=entropy&cs=srgb&w=600",
        "detalhes_markdown": "# Plano de Desenvolvimento Individual (PDI): Um Roteiro para o Crescimento\n\n**Descrição:** O Plano de Desenvolvimento Individual (PDI) é um plano de ação estruturado e documentado, criado em colaboração entre um funcionário e seu gestor, para ajudar o funcionário a aprimorar suas habilidades (competências técnicas e comportamentais) e avançar em sua carreira. Ele alinha os objetivos de crescimento do indivíduo com as necessidades e oportunidades da empresa.\n\n**Quando usar:** Idealmente, de forma contínua, sendo revisado em reuniões 1:1. É frequentemente iniciado após ciclos de avaliação de desempenho ou feedback 360, que revelam áreas de desenvolvimento.\n\n---\n\n## Estrutura de um PDI\n\nUm PDI eficaz geralmente contém os seguintes elementos, usando o modelo 70-20-10 como guia para as ações:\n\n1.  **Objetivo de Desenvolvimento:**\n    *   Qual é a competência ou habilidade específica a ser desenvolvida? (Ex: \"Melhorar a comunicação com stakeholders\", \"Aprender a linguagem de programação Python\").\n\n2.  **Justificativa / Motivação:**\n    *   Por que este desenvolvimento é importante para o funcionário e para a empresa?\n\n3.  **Ações de Desenvolvimento (Modelo 70-20-10):**\n    *   **70% - Experiências Práticas (On-the-Job):** O aprendizado mais eficaz vem da prática.\n        *   *Exemplos:* Liderar um pequeno projeto, assumir a responsabilidade de apresentar os resultados da equipe, fazer mentoria para um novo colega.\n    *   **20% - Aprendizado com Outros (Social Learning):** Aprender através de interações.\n        *   *Exemplos:* Encontrar um mentor, participar de uma comunidade de prática, fazer 'pair programming' com um especialista.\n    *   **10% - Aprendizado Formal (Educação):** Cursos e treinamentos estruturados.\n        *   *Exemplos:* Fazer um curso online, participar de um workshop, ler um livro sobre o tema.\n\n4.  **Recursos Necessários:**\n    *   O que será necessário para executar as ações? (Ex: Orçamento para um curso, tempo alocado para um projeto).\n\n5.  **Métricas de Sucesso:**\n    *   Como saberemos que o objetivo foi alcançado? (Ex: \"Apresentar os resultados da sprint para os stakeholders com feedback positivo\", \"Entregar um script em Python que automatiza a tarefa X\").\n\n6.  **Prazos:**\n    *   Datas de início e fim para cada ação.\n\n---\n\n## Papel do Gestor e do Liderado\n\n*   **Liderado:** É o protagonista do seu próprio desenvolvimento. Ele é responsável por identificar seus interesses, executar as ações e buscar ajuda.\n*   **Gestor:** Atua como um facilitador e coach. Ele ajuda o liderado a identificar oportunidades, remove obstáculos, fornece recursos e dá feedback contínuo.\n\n### Links Relevantes\n\n*   [Guia da Indeed sobre PDI](https://www.indeed.com/career-advice/career-development/professional-development-plan)"
    },
    {
        "nome": "Entrevista por Competências (Behavioral Interview)",
        "descricao": "Uma técnica de entrevista onde o candidato é solicitado a descrever situações passadas para demonstrar competências específicas. A premissa é que o comportamento passado é o melhor previsor do comportamento futuro.",
        "quando_usar": "Durante o processo de recrutamento e seleção para avaliar habilidades comportamentais (soft skills) de forma objetiva.",
        "link": "https://www.thebalancecareers.com/behavioral-job-interviews-2059620",
        "categorias": ["Recrutamento"],
        "imagem": "https://images.unsplash.com/photo-1573497491208-6b1acb260507?ixlib=rb-4.0.3&q=85&fm=jpg&crop=entropy&cs=srgb&w=600",
        "detalhes_markdown": "# Entrevista por Competências (Behavioral Interview): O Passado Prevê o Futuro\n\n**Descrição:** A Entrevista por Competências, ou Entrevista Comportamental, é uma técnica de entrevista estruturada onde o candidato é solicitado a descrever situações passadas para demonstrar competências específicas. A premissa fundamental é que **o comportamento passado é o melhor previsor do comportamento futuro**.\n\n**Quando usar:** Durante o processo de recrutamento e seleção para avaliar habilidades comportamentais (soft skills) como liderança, trabalho em equipe, resolução de problemas e comunicação de forma objetiva e baseada em evidências.\n\n---\n\n## A Técnica STAR\n\nAs perguntas em uma entrevista comportamental geralmente começam com \"Me conte sobre uma vez em que...\" ou \"Dê um exemplo de uma situação em que...\". O candidato é encorajado a responder usando o **método STAR** para estruturar sua resposta:\n\n*   **S - Situação (Situation):** Descreva o contexto. Onde você estava? Qual era o projeto ou o desafio?\n*   **T - Tarefa (Task):** Qual era a sua responsabilidade específica naquela situação? Qual era o seu objetivo?\n*   **A - Ação (Action):** O que **você** fez? Descreva as ações específicas que você tomou. Use \"Eu fiz...\" em vez de \"Nós fizemos...\".\n*   **R - Resultado (Result):** Qual foi o resultado das suas ações? O que aconteceu? Se possível, quantifique o resultado.\n\n## Exemplos de Perguntas por Competência\n\n| Competência | Pergunta Comportamental |\n| :--- | :--- |\n| **Resolução de Problemas** | \"Me conte sobre uma vez em que você enfrentou um problema complexo no trabalho. Como você o abordou e qual foi o resultado?\" |\n| **Trabalho em Equipe** | \"Descreva uma situação em que você teve um conflito com um colega de equipe. Como você lidou com isso?\" |\n| **Liderança** | \"Dê um exemplo de uma vez em que você teve que motivar sua equipe para alcançar um objetivo difícil.\" |\n| **Adaptabilidade** | \"Me conte sobre uma mudança significativa que ocorreu em um projeto ou na sua equipe. Como você se adaptou a ela?\" |\n| **Iniciativa** | \"Descreva uma situação em que você identificou uma oportunidade de melhoria e tomou a iniciativa para implementá-la.\" |\n\n---\n\n## Por que Funciona?\n\n*   **Baseada em Evidências:** Em vez de respostas hipotéticas (\"O que você faria se...\"), a entrevista comportamental foca em experiências reais e comprovadas.\n*   **Redução de Viés:** Por ser estruturada e focada em competências predefinidas, ajuda a reduzir o viés do entrevistador e permite uma comparação mais justa entre os candidatos.\n*   **Avaliação Profunda:** Revela não apenas o que o candidato fez, mas também como ele pensa, age sob pressão e interage com os outros.\n\n### Links Relevantes\n\n*   [Guia da The Balance Careers sobre Entrevistas Comportamentais](https://www.thebalancecareers.com/behavioral-job-interviews-2059620)"
    },
    {
        "nome": "Pesquisa de Clima e Engajamento",
        "descricao": "Uma ferramenta para medir a percepção e a satisfação dos funcionários em relação ao ambiente de trabalho, liderança, cultura e outros fatores. Os resultados ajudam a identificar pontos de melhoria.",
        "quando_usar": "Periodicamente (anual ou semestralmente) para monitorar a saúde organizacional e guiar iniciativas de melhoria do ambiente de trabalho.",
        "link": "https://www.qualtrics.com/experience-management/employee/employee-engagement/",
        "categorias": ["Engajamento", "Cultura"],
        "imagem": "https://images.unsplash.com/photo-1516298773066-c48f8e9bd92b?ixlib=rb-4.0.3&q=85&fm=jpg&crop=entropy&cs=srgb&w=600",
        "detalhes_markdown": "# Pesquisa de Clima e Engajamento: O Termômetro da Organização\n\n**Descrição:** Uma ferramenta para medir a percepção (clima) e o nível de conexão emocional e comprometimento (engajamento) dos funcionários com a organização. Através de um questionário, geralmente anônimo, a pesquisa coleta dados sobre a satisfação dos colaboradores em relação a fatores como ambiente de trabalho, liderança, cultura, remuneração, oportunidades de crescimento e bem-estar.\n\n**Quando usar:** Periodicamente (anual, semestral ou trimestralmente) para monitorar a saúde organizacional, identificar pontos fortes e fracos, e guiar iniciativas estratégicas de melhoria do ambiente de trabalho e da gestão de pessoas.\n\n---\n\n## Clima vs. Engajamento\n\n*   **Clima Organizacional:** É a **percepção** coletiva que os funcionários têm da empresa. É uma 'foto' do ambiente de trabalho em um determinado momento. Responde à pergunta: \"Como é trabalhar aqui?\".\n\n*   **Engajamento:** É o **vínculo** emocional e o comprometimento do funcionário com a organização e seus objetivos. Um funcionário engajado não apenas está satisfeito, mas também está disposto a ir além (dar a 'extra mile'). Responde à pergunta: \"O quanto eu me importo com o sucesso daqui?\".\n\n## Dimensões Comuns da Pesquisa\n\nUm questionário de pesquisa de clima e engajamento geralmente aborda dimensões como:\n\n*   **Liderança:** Confiança e apoio do gestor direto.\n*   **Reconhecimento:** Sentir-se valorizado pelo trabalho.\n*   **Desenvolvimento:** Oportunidades de crescimento e aprendizado.\n*   **Remuneração e Benefícios:** Percepção de justiça e competitividade.\n*   **Ambiente de Trabalho:** Colaboração, segurança psicológica e bem-estar.\n*   **Alinhamento Estratégico:** Clareza sobre a missão e os objetivos da empresa.\n\n---\n\n## O Ciclo da Pesquisa\n\n1.  **Planejamento:** Definir os objetivos da pesquisa e as dimensões a serem avaliadas.\n2.  **Comunicação:** Comunicar claramente aos funcionários o propósito da pesquisa, garantir o anonimato e incentivar a participação.\n3.  **Aplicação:** Disponibilizar o questionário.\n4.  **Análise de Resultados:** Analisar os dados, identificar os principais pontos positivos e as áreas críticas de melhoria. Segmentar os resultados por departamento ou equipe pode revelar insights mais profundos.\n5.  **Plano de Ação:** **Esta é a etapa mais importante.** A liderança deve criar e comunicar planos de ação claros para abordar os problemas identificados. Não fazer nada após uma pesquisa é pior do que não fazer a pesquisa, pois gera cinismo e desconfiança.\n6.  **Acompanhamento:** Monitorar o progresso dos planos de ação e comunicar os avanços para a equipe.\n\n### Links Relevantes\n\n*   [Guia da Qualtrics sobre Engajamento de Funcionários](https://www.qualtrics.com/experience-management/employee/employee-engagement/)"
    }
]